
public class HomeWork01 {
    public static void main(String[] args) {
        Task1 task1Obj = new Task1();
        task1Obj.msg();

        Task2 task2Obj = new Task2();
        task2Obj.msg();

        Task3 task3Obj = new Task3();
        task3Obj.msg();



//        4. В консоли запросить имя пользователя. В зависимости от текущего времени, вывести приветствие вида:
//        "Доброе утро, <Имя>!", если время от 05:00 до 11:59
//        "Добрый день, <Имя>!", если время от 12:00 до 17:59;
//        "Добрый вечер, <Имя>!", если время от 18:00 до 22:59;
//        "Доброй ночи, <Имя>!", если время от 23:00 до 4:59
    }



}
